// ДЗ:
// 1. Створіть змінну, що симулює вибір варіанта зі
// списку. Виводьте повідомлення залежно від обраного
// варіанта: "Кава", "Чай" або "Сік". Використайте switch

let message = prompt("Оберіть напій")

switch (message) {
    case "Кава":
    alert("Тримайте каву");
    break;

    case "Чай":
    alert("Тримайте чай");
    break;

    case "Сік":
    alert("Тримайте сік");
    break;

    default: alert(`Неможу знайти напій ${message}`);
}

// 2. Створіть змінну для зберігання введеного рядка,
//  який може бути днем тижня. Якщо це робочий день —
//   виведіть повідомлення про робочий день, якщо вихідний —
//    про вихідний.

 let note = prompt("Напишіть будь який день неділі")
 if (note === "Понеділок" ||  note === "Вівторок" || note === "Середа" ||  note === "Четверг" || note === "П'ятниця") {
    alert("Це робочий день");
 } else if (note === "Субота" || note === "Неділя") {
    alert("Це вихідний день");
 } else {
    alert("Це день неділі?...");
 }

// 3. Створіть змінну для зберігання номера місяця.
//  За номером місяця визначайте пору року і виводьте відповідне повідомлення.

let num = Number(prompt("Напишіть число яке відповідає місяцю"));
switch (num) {
  case 1:
  case 2:
  case 3:
    alert("Зима");
    break;

  case 4:
  case 5:
  case 6:
    alert("Весна");
    break;

  case 7:
  case 8:
  case 9:
    alert("Літо");
    break;

  case 10:
  case 11:
  case 12:
    alert("Осінь");
    break;

  default:
    alert("Число не відповідає жодному місяцю!!!");
}

// 4. Створіть змінну для зберігання назви кольору.
//  Виводьте повідомлення відповідно до вибраного кольору:
//   якщо "червоний" — "стоп", "зелений" — "йти", "жовтий" — "чекати".

let text = prompt("Оберіть одинз 3 кольорів. Червоний, зелений, жовтий");
switch (text) {
    
  case "Червоний":
    alert("стоп");
    console.log("стоп");
    break;

  case "Зелений":
    alert("йти");
    console.log("йти");
    break;

  case "Жовтий":
    alert("чекати");
    console.log("чекати");
    break;
}
